{
    "Language": "Sprach",
    "Home": "Dahoam",
    "setupDatabaseChooseDatabase": "Wos für a Datenbank wuist du?",
    "setupDatabaseEmbeddedMariaDB": "Da brauchst nix mocha. Des Docker Buidl hod a Datenbank dabai und nimmt MariaDB. Uptime Kuma verbint se mit Unix Socket.",
    "Import": "Eine spuin",
    "respTime": "Antwort-Zeit (ms)",
    "Create your admin account": "Mach Dein Admin-Zugang",
    "matrixDesc2": "Es wead dringend empfohln, dass Du an neia Benutza a'legst und ned de Zugangs-Schlüssl (Access Token) vo Deim eigana Matrix-Benutza vawendst, wei de do den voiständign Zuagriff auf Dei Konto und olle Räum, wo Du dabei bist, zualassn dadn.Stattdessn: Leg an neia Benutza a' und lads eam nua in den Raum ei, in dem wo Du de Benachrichtigunga griang wuist.Du kriagst den Zugangs-Schlüssl (Access Token) iatz, indemst des ausfiahrst: {0}",
    "jsonQueryDescription": "Nutz a JSON-Abfrag (JSON query), um spezifische Datn aus da JSON-Antwort vom Server auszulesn und z'extrahiern. Oder: Wenn Du koa JSON-Antwort erwarts, nimm \"$\" fia de rohe Antwort (raw response).Des Ergebnis wead dann mit'm erwartetn Wert (expected value) oiss wia a Text (as strings) vaglichn. Fia d'Dokumentation schaugst bittschee bei {0} noch, und zum Testn und Experimentiern is {1} da richtige Blotz.",
    "receiverInfoSevenIO": "Wenn de Numma vom Empfänger ned in Deitschland (Germany) is, muaßt den Lända-Code (country code) davo setzn. Beispui: Fia d'Lända-Kennzoi 1 vo de USA (US) nimmst 117612121212 statt 017612121212",
    "trustProxyDescription": "Vertrau de 'X-Forwarded-*' Header. Wenn Du de korrekte Client IP kriagn wuixt und Dei Uptime Kuma hinter am Proxy (wia Nginx oda Apache) lafft, dann muaßt Du des eischaltn.",
    "wayToGetFlashDutyKey": "Um Uptime Kuma mit Flashduty z'integrieran: Geh auf Kanäl (Channels) > An Kanal auswähln > Integrationa (Integrations) > A neie Integration hizuafeagn (Add a new integration), wähld Uptime Kuma, und kopierst de Push URL.",
    "shrinkDatabaseDescriptionSqlite": "Fia SQLite: Start de Datenbank-Reinigung ({vacuum}). Zwoa is {auto_vacuum} scho eingschoitn, owa des ko de Datenbank ned defragmentiern und aa ned de oanzalnan Datenbank-Seitn nei packa, so wia des da {vacuum}-Befehl macha tuat.",
    "matrixDesc1": "Du findst de interne Raum-ID (internal room ID), indemst in Deim Matrix Client in de erweitertn Eistellunga vom Raum (advanced section of the room settings) nochschaust. De soitat wia !QMdRCpUIfLwsfjxye6:home.server ausschaun.",
    "lowIntervalWarning": "Bist da sicha, dassd den Intervall-Wert unta 20 Sekundn setzn wuixt? D'Leistung ko schlechter wern, bsondas wenn a Haufa Monitore laffa.",
    "rabbitmqHelpText": "Um den Monitor nutzn z'könna, muaßt in Deiner RabbitMQ-Eirichtung des Vawoitungs-Plugin (Management Plugin) aktiviern. Fia mehr Informationa, schau bitte in de {rabitmq_documentation}.",
    "promosmsTypeFull": "SMS VOLL - De Premium-Stufn vo SMS. Du kannst Deinen O'senda-Nam vawendn (Du muaßt den Nam eascht registriern). Zuavässig fia Warnunga.",
    "disableauth.message2": "Des is fia Szenarien {intendThirdPartyAuth} voa Uptime Kuma denkt, wia Cloudflare Access, Authelia oda andane Authentifizierungs-Mechanisma.",
    "webhookGetMethodDesc": "GET schickt Datn ois Abfrage-Parameter (Query Parameters) und erlaubt's ned, an Body z'konfiguriarn. Is nützlich zum Auslös'n vo Uptime Kuma Push Monitore.",
    "steamApiKeyDescription": "Zum Iabawachn vo am Steam Spui-Server brauchst an Steam Web-API Schlüssl. Du kannst Deinen API Schlüssl do registriern: ",
    "tailscalePingWarning": "Damitst den Tailscale Ping Monitor nutzn kannst, muaßt Du Uptime Kuma ohne Docker installiern und auf Deim Server aa den Tailscale Client installiern.",
    "telegramServerUrlDescription": "Um de Begrenzunga vo da Telegram Bot API aufz'hebn oda um Zuagang in blockierte Gengdn (China, Iran, etc.) z'kriang. Fia mehr Informationa klick {0}. Standard: {1}",
    "Long-Lived Access Token can be created by clicking on your profile name (bottom left) and scrolling to the bottom then click Create Token. ": "An langlebandn Zuagangs-Schlüssl kannst erstella, indemst auf Deinen Profilnama (unten links) klickst, dann ganz nach untn scrolldst und auf 'Token erstella' klickst. ",
    "backupOutdatedWarning": "Vaoitet: Wei vui neie Funktiona dazua kemma san und de Backup-Funktion a weng vachlässigt worn is, ko's koa vollständigs Backup erstella oda widaherstella.",
    "A list of Notification Services can be found in Home Assistant under \"Developer Tools > Services\" search for \"notification\" to find your device/phone name.": "A Listn vo de Benachrichtigungs-Dienst' findst Du im Home Assistant unta \"Entwickler-Wergzeig' > Dienst'\" (Developer Tools > Services). Suach nach \"notification\", um de Namens- oda Telefonnumma vo Deim Gerät/Handy z'findn.",
    "wayToGetBaleChatID": "Du kannst Dei Chat-ID kriang, indemst a Nachricht an den Bot schickst und dann auf dea URL schaust, um de Chat-ID z'sehn:",
    "aboutMattermostChannelName": "Du kannst den Standardkanal, in den wo da Webhook postet, iabaschreim, indemst den Kanal-Nama in des Feld \"Kanal-Nama\" (Channel Name) eigibst. Des muaß owa in de Eistellunga vom Mattermost Webhook freigebn (enabled) sei. Beispui: #andana-kanal",
    "deleteChildrenMonitors": "A de direkt untagordnatn Monitore und dera Kind-Monitore, wenns welche ham, wead glöscht. | A olle {count} direkt untagordnatn Monitore und dera Kind-Monitore, wenns welche ham, wern glöscht",
    "enableDefaultNotificationDescription": "De Benachrichtigung wead standardmäßig fia neie Monitore aktiv sei. Du kannst de Benachrichtigung owa fia jedn Monitor separat deaktivern.",
    "importHandleDescription": "Wähld 'Bestehends iabaschpring', wennst jedn Monitor oda jede Benachrichtigung mit'm gleichn Nama iabaschpring wuixt. 'Iabaschreim' löscht jedn scho vorhandna Monitor und jede Benachrichtigung.",
    "aboutNotifyChannel": "'Kanal benachrichtign' löst a Desktop- oda Handy-Benachrichtigung ia olle Mitglieda vom Kanal aus, egal ob de grad auf 'aktiv' oda 'weg' gstellt san.",
    "aboutSlackUsername": "Ändert den Anzeignama vom Nachrichtn-O'senda. Wennst jemandn erwähna wuixt, pock des stattdessn in den freindlichn Nam (friendly name) nei.",
    "aboutChannelName": "Gib den Kanalnam im {0} Kanalnam-Feld ei, wennst den Webhook Kanal umgeh wuixt. Zum Beispui: #anderer-kanal",
    "wayToGetPagerDutyKey": "Du kriagst des, indemst auf Service -> Service-Vazeichnis (Service Directory) -> (An Service auswähln) -> Integrationa (Integrations) -> Integration hizuafeagn (Add integration) gähst. Do kannst nach \"Events API V2\" suacha. Mehr Info: {0}",
    "apiKeyAddedMsg": "Dein API-Schlüssl is hinzuagfügt worn. Bittschön notierst eam, wei a nimma zoagt wead.",
    "monitorToastMessagesDescription": "De Toast-Benachrichtigunga fia Monitore vaschwindn nach da eigebnan Zeit in Sekundn. Setz auf -1, um d'Zeitbeschränkung (Timeout) auszschaltn. Setz auf 0, um de Toast-Benachrichtigunga komplett auszschaltn.",
    "gamedigGuessPortDescription": "Da Port, der wo vom Valve Server Query Protokoll gnutzt wead, ko andas sei ois wia da Client-Port. Probier des, wenn da Monitor koane Vabindung zum Server herstella ko.",
    "bitrix24SupportUserID": "Gib Dei Benutzernummer in Bitrix24 ei. De ID kannst aus'm Link auselesn, wennst aufs Profil vom Nutzer gehst.",
    "remoteBrowserToggle": "Normalawais lafft Chromium im Uptime Kuma Container. Du kannst an Fern-Browser vawendn, indemst den Schalta (Switch) umlegst.",
    "callMeBotGet": "Do kannst an Endpunkt (endpoint) fia {0}, {1} und {2} generiern. Owa pass auf, dassd Du gfladert wern kannst (rate limited). De Begrenzunga san: {3}",
    "gtxMessagingFromHint": "Auf de Handys (mobile phones) segt da Empfänger de TPOA (Absender-Adress) oiss wia den Schicka vo da Nochricht. Erlaubt san: Maximal 11 alphanumerische Zeichen, a Kurz-Code (shortcode), da lokale Lang-Code (longcode), oda internationale Nummern ({e164}, {e212} oda {e214})",
    "cellsyntOriginatortypeNumeric": "Numerischa Wert (maximal 15 Stellan) mit da Telefonnumma im internationaln Format, owa ohne de \"00\" am Ofang (zum Beispui muaß d'UK-Nummer 07920 110 000 auf 447920110000 gsetzt wern). De Empfänger kenna auf de Nochricht antwortn.",
    "cellsyntOriginator": "Auf'm Handy vom Empfänger ois da O'senda vo da Nachricht sichtbar. De erlaubtn Wert' und de Funktion hängan vom Parameter 'Originatortyp' (originatortype) ob.",
    "snmpOIDHelptext": "Gib de OID (Object Identifier) fia den Sensor oda Status ei, denst iabawachn wuixt. Wennst ned woaßt, wos de OID is, nutz netzwerk-vawoitung-Wergzeig (network management tools) wia MIB-Browser oda SNMP-Software.",
    "Either a text sender ID or a phone number in E.164 format if you want to be able to receive replies.": "Entweda a Text-O'senda-ID oda a Telefonnumma im E.164-Format, wennst Antworta kriang wuixt.",
    "smtpHelpText": "'SMTPS' test, ob SMTP iaba TLS (Vaschlüsselung) funktioniern tuat; 'TLS ignoriern' (Ignore TLS) vabindt si iaba an unvaschlüsseltn Text (plaintext); 'STARTTLS' vabindt si, gibst an STARTTLS-Befehl aus und prüft des Server-Zertifikat. Koana vo dene Modi schickt a E-Mail.",
    "wayToWriteWahaChatId": "Nimm entweda:D'Telefonnumma mit da internationaln Vuawoi, owa ohne des Plus-Zeichn am Ofang ({0}),d'Kontakt-ID ({1}),oda d'Gruppn-ID ({2}).De Benachrichtigunga wern dann vo da WAHA Session an de Chat ID gschickt.",
    "Webpush Helptext": "Web Push funktioniert nur mid SSL (HTTPS) Verbindunga. Fia iOS-Gerät' muaß de Webseitn vorher zum Homescreen zuagfügt wern.",
    "Yes": "Basst",
    "Username": "Wia Du hoaßt",
    "Password": "Dei G'heimnis",
    "Remember me": "Eingloggt bleim",
    "Login": "Eiloggn",
    "No Monitors, please": "Koane Ibachunga fia de Betriebsdauer, biddschee",
    "add one": "Oana dazua",
    "Notification Type": "Wia da Alarm kimmt",
    "Email": "D'E-Mail",
    "Test": "Probelauf",
    "Certificate Info": "Wos am Zertifikat dro steht",
    "Last Result": "Letzts Ergebnis",
    "Export": "Aussagebn",
    "notAvailableShort": "Koa Angob",
    "Default enabled": "Vo Haus aus eigschalt",
    "Apply on all existing monitors": "Bei olle bstehndn o'wendn",
    "Create": "Mach'n",
    "Clear Data": "Ois wida leer macha",
    "Events": "Wos gscheng is",
    "Heartbeats": "Lebenszeicha",
    "Auto Get": "vo aloa nehma",
    "Schedule maintenance": "Termin fia d'Wartung macha",
    "alertWrongFileType": "Bittschee, such a JSON-Datei aus.",
    "Clear all statistics": "Olle Statistiken putzn",
    "Skip existing": "Bstehnd's auslassn",
    "Overwrite": "Ibaschreim",
    "Options": "Eistellunga",
    "Keep both": "Boade bhalta",
    "Verify Token": "Schlüssl ibaprüfn",
    "Setup 2FA": "2FA eistelln",
    "Enable 2FA": "2FA aktiviern",
    "Disable 2FA": "2FA deaktivern",
    "tagNameExists": "A System-Tag mid dem Nam existiert scho. Bittschön wählst eam aus da Listn aus oda nimmst an andern Nam.",
    "wayToGetTelegramChatID": "Du kannst Dei Chat-ID kriang, indemst a Nachricht an den Bot schickst und dann auf dea URL schaust, um de Chat-ID z'sehn:",
    "chromeExecutableDescription": "Fia de Docker-Nutza: Wenn Chromium no ned installiert is, ko des a boar Minutn dauern, bis' installiert is und des Test-Ergebnis angezeigt wead. Des braucht 1 GB Plotz auf da Festplattn.",
    "smtpLiquidIntroduction": "De foigndn zwoa Föida kenna iaba de Liquid Templating Sproch mid Vorlagn bfüllt wern. Schaug da de {0} fia d'Vawendungs-Anweisung'n o. Des san de vafügboarn Variabln:",
    "wayToGetDiscordThreadId": "A Thread-/Forumspost-ID kriang is ähnlich wia a Kanal-ID kriang. Schau da mehr iaba de IDs in {0} o",
    "whatHappensAtForumPost": "Erstell an neia Forumsbeitrag. Des postet NED Nachrichtn in an existieradn Beitrag. Um in an existieradn Beitrag z'postn, nutz \"{option}\"",
    "wayToGetDiscordURL": "Des kannst kriagn, indemst auf Server Einstellunga -> Integrations -> Webhooks oschaung -> Neia Webhook gehst",
    "Affected Monitors": "Wos ois btroffa is",
    "Pick Affected Monitors...": "Btroffne wehln…",
    "Start of maintenance": "O'fang vo da Wartung",
    "All Status Pages": "Olle Status-Seitn",
    "Select status pages...": "Status-Seitn aussuacha…",
    "alertNoFile": "Bittschee, such a Datei zum Eine spuin aus.",
    "liquidIntroduction": "Vorlagn-Eistejung (Templatability) wead iaba de Liquid Templating Sproch erreicht. Schau da de {0} fia d'Vawendungs-Anweisung'n o. Des san de vafügboarn Variabln:",
    "twilioApiKeyHelptext": "Da API-Schlüssl (API key) is optional, owa ma riat dazua. Du kannst entweda de Account SID und des AuthToken vo da Twilio-Konsoin-Seitn (TwilioConsole) hernehma, oda de Account SID und des Paar aus API-Schlüssl und API-Schlüssl-Geheimnis (Api Key secret)",
    "remoteBrowsersDescription": "Fern-Browser (Remote Browsers) san a Alternative dazua, Chromium lokal laufn z'lassn. Du kannst des mid am Dienst wia browserless.io eirichtn oda di mit Deim eigena Browser vabindn",
    "wayToWriteWhapiRecipient": "De Telefonnumma mit da internationaln Vuawoi, owa ohne des Plus-Zeichn am Ofang ({0}), de Kontakt-ID ({1}) oda de Gruppn-ID ({2}).",
    "gtxMessagingApiKeyHint": "Dein API-Schlüssl findst Du unta: Mei Routing Kontn > Kontn-Informationa zang > API Zugangsdatn > REST API (v2.x)",
    "cellsyntDestination": "D'Telefonnummer vom Empfänger muaß im internationaln Format eigebn wern, mit \"00\" am Ofang, gfoigt vo da Lända-Kennzoi. Beispui: Fia d'UK-Nummer 07920 110 000 schreibst 00447920110000 (maximal 17 Stellan insgesamt). Begrenzung: Pro HTTP-Anfrag san maximal 25.000 Empfänger erlaubt, de wo mit am Komma trennt san.",
    "snmpCommunityStringHelptext": "Dea Zeichnkettn (String) funktioniert ois Passwort, um den Zuagang zu de SNMP-fähign Gerät' z'bestätign und z'steiern. Schaug, dass des mid Deiner SNMP-Geräte-Konfiguration zammbasst.",
    "2FA Settings": "2FA Eistellunga",
    "Two Factor Authentication": "Zwoafache Bestätigung",
    "wayToWriteEvolutionRecipient": "De Telefonnumma mit da internationaln Vuawoi, owa ohne des Plus-Zeichn am Ofang ({0}), de Kontakt-ID ({1}) oda de Gruppn-ID ({2}).",
    "confirmDeleteTagMsg": "Bist da sicher, dass Du den Tag lösch'n wuixt? Monitore, de wo mid dem Tag vabundn san, wean ned g'löscht.",
    "goAlertInfo": "GoAlert is a o'ffane Quell-Code-Anwendung (open source application) fia Bereitschafts-Planung, automatisierte Eskalationa und Benachrichtigunga (wia SMS oda telefonische O'ruaf). Automatisch de richtige Person, auf de richtige Weis und zum richtign Zeitpunkt eischaltn! {0}",
    "goAlertIntegrationKeyInfo": "Hoi da an generischn API Integrations-Schlüssl fia den Dienst in dem Format \"aaaaaaaa-bbbb-cccc-dddd-eeeeeeeeeeee\". Normalawais is des da Wert vom Token-Parameter in da URL, de wo kopiert worn is.",
    "promosmsTypeSpeed": "SMS GAS GEBN - Höchste Priorität im System. Sehr schnell und zuavässig, owa kostspülig (zirka doppelt so teia wia SMS VOLL).",
    "enableProxyDescription": "Dea Proxy wirkt se eascht auf de Monitor-Anfrogn aus, wenn er aktiviert is. Du kannst den Proxy fia olle Monitore iaba den Aktivierungs-Status temporär deaktiviern.",
    "setAsDefaultProxyDescription": "Dea Proxy wead standardmäßig fia neie Monitore aktiv sei. Du kannst den Proxy owa fia jedn Monitor separat deaktivern.",
    "The current connection may be lost if you are currently connecting via Cloudflare Tunnel. Are you sure want to stop it? Type your current password to confirm it.": "D'aktuelle Vabindung ko valorn geh, wennst grod iaba an Cloudflare Tunnel vabundn bist. Bist da sicha, dass Du des been'dn wuixt? Tipp Dei aktuells Passwort ei, ums z'bestätign.",
    "wayToGetLineChannelToken": "Greif z'eascht auf {0} zua, erstöi an Provider und an Kanal (Channel) (Messaging API). Nachad kriagst de Zugangs-Schlüssl (Channel access token) und d'Benutza-ID (User ID) in de obn gnanntn Menü-Punkte.",
    "aboutIconURL": "Du kannst a Link zu am Buidl im Feld \"Buidl-URL\" (Icon URL) eigebn, um des Standard-Profilbuidl z'iabaschreim. Des wead owa ned vawendt, wenn a Icon Emoji eigstellt is.",
    "Resume": "Weida macha",
    "Edit": "Ändern",
    "Current": "Groaßgrad",
    "Monitor": "Da Schirm | De Schirm",
    "day": "da dog | de dog",
    "setupDatabaseSQLite": "A einfachs Datenbank-Datei, empfehlenswert für kloane Installationen. Vorma v2.0.0 hod Uptime Kuma SQLite als Standard-Datenbank nutzt.",
    "Settings": "Einstellungen",
    "New Update": "Neies Update",
    "Appearance": "Aussehng",
    "General": "Allgemein",
    "General Monitor Type": "Allgemeiner Monitortyp",
    "Game": "Spiel",
    "Add": "Hinzuafügn",
    "Quick Stats": "Kurze Statistik",
    "Up": "Oba",
    "statusMaintenance": "Wartung",
    "pauseDashboardHome": "Pausn",
    "Name": "Nam",
    "Status": "Zuastand",
    "-day": "-dog",
    "hour": "stund",
    "Ping": "Ping",
    "Monitor Type": "De Sorte vom Schirm",
    "Keyword": "Schlüsselwort",
    "Invert Keyword": "Wosd ned findn wuisd",
    "Expected Value": "Wosd davo ausgähst",
    "URL": "URL",
    "Import Backup": "Backup aufspuin",
    "Port": "Port",
    "Retries": "Wia oft ma's no probiern",
    "resendEveryXTimes": "Wieda schicka olle {0} Mal",
    "ignoreTLSError": "Auf d'Vaschlüsselungs-Fehler pfeifn",
    "Upside Down Mode": "Umdraht-Modus",
    "Max. Redirects": "Max. Wos umleiten deaf",
    "No": "Nix da",
    "setupDatabaseMariaDB": "Verbinda di mit a externa MariaDB-Datenbank. Du miast de Verbindungsinfos für d’Datenbank oistelln.",
    "settingUpDatabaseMSG": "Datenbank wird einrichtet. Des ko a Weile dauern, bitte hob a bisserl Geduld.",
    "dbName": "Datenbank-Name",
    "Dashboard": "Dashboard",
    "Help": "Hilfe",
    "Theme": "Design",
    "Primary Base URL": "Primäre Basis-URL",
    "Version": "Version",
    "Check Update On GitHub": "Auf GitHub nach’m Update kucken",
    "List": "Liast",
    "Add New Monitor": "Neien Monitor hinzufügn",
    "Down": "Owa",
    "Pending": "In Wartnstellung",
    "Maintenance": "Wartung",
    "Unknown": "Unbekannt",
    "Cannot connect to the socket server": "Ko ned mit’m Socket-Server verbinden",
    "Reconnecting...": "Verbinda wieda…",
    "Passive Monitor Type": "Fauler Monitor",
    "Specific Monitor Type": "Besonderer Monitor",
    "markdownSupported": "Markdown geht",
    "Pause": "Pausn",
    "DateTime": "Zeit und's Datum",
    "Message": "Botschaft",
    "No important events": "Koane wichtig'n G'schichtn",
    "Delete": "Wegmacha",
    "Uptime": "De Zeit, wo de Maschin laaft",
    "Cert Exp.": "Zertifikat Ablauf",
    "-hour": "-stund",
    "Response": "Wos zruck kimmt",
    "Friendly Name": "Da Nam, wo leicht zum Vasteh is",
    "Heartbeat Interval": "'S Interval vom Lebnszeichn",
    "Request Timeout": "Max. G'wart",
    "Either enter the hostname of the server you want to connect to or localhost if you intend to use a locally configured mail transfer agent": "Gib entweda den Hostnama vom Server ei, mid demst di vabindn wuixt, oda {localhost}, wennst a {local_mta} nutzn wuixt",
    "Hostname": "Hostname",
    "timeoutAfter": "D'Zeit is rum nach {0} Sekundn",
    "Heartbeat Retry Interval": "Wia lang's dauert, bis ma's Lebnszeichn no amoi probiert",
    "Resend Notification if Down X times consecutively": "D'Nachricht wieda schicka, wann X-mal glei ausgfalln is",
    "Advanced": "De tiefa Sach",
    "checkEverySecond": "Noch {0} Sekundn no amoi frogn",
    "retryCheckEverySecond": "Noch {0} Sekundn no amoi frogn",
    "resendDisabled": "Wieda schicka ausgschoidt",
    "retriesDescription": "Max. Vasuch, bevur de Maschin \"Ausgfalln\" hoaßt und's a Nachricht gibt",
    "upsideDownModeDescription": "Status umdraha: Is d'Maschin do, is ned do.",
    "maxRedirectDescription": "Hächste Anzoi an Umleitunga, dene ma nacha gähd. Bei 0 is's ausgschoidt.",
    "Resolver Server": "Auflös-Server",
    "Resource Record Type": "Art vom Eitrag",
    "Repeat Password": "Passwoat nomoi eigehm",
    "Export Backup": "Sicherung aussanehgn",
    "languageName": "Bairisch",
    "signl4Docs": "Mehr Informationa, wia ma SIGNL4 konfiguriert und wia ma de SIGNL4 Webhook URL findt, gibts in de {0}."
}
